{
  "augmentin": "A combination antibiotic used to treat a wide variety of bacterial infections.",
  "pan d": "A proton pump inhibitor and prokinetic agent, used to treat gastroesophageal reflux disease (GERD).",
  "diclofenac": "A nonsteroidal anti-inflammatory drug (NSAID) used to treat pain and inflammatory conditions.",
  "omeprozole": "A proton pump inhibitor (PPI) that reduces the amount of acid produced in the stomach.",
  "betaloc": "A beta-blocker used to treat high blood pressure (hypertension) and angina.",
  "enzoflam": "A combination drug with enzymes and NSAIDs to relieve swelling (edema) and pain.",
  "hexigel gum paint": "An antiseptic gel (chlorhexidine) to treat gingivitis, mouth ulcers, and oral infections.",
  "ultrafen-plus": "A combination painkiller, often containing an NSAID and paracetamol, for moderate pain.",
  "relentus": "A cough syrup or tablet formulation for relieving cough, cold, and allergy symptoms.",
  "progen": "Often a brand name for progesterone or a protein supplement.",
  "ultracal-d": "A supplement containing Calcium and Vitamin D3, used to treat or prevent bone loss.",
  "cartilix": "A supplement, often containing glucosamine, aimed at supporting cartilage and joint health.",
  "dorzolamidum": "A carbonic anhydrase inhibitor used as eye drops to lower pressure inside the eye.",
  "cimetidine": "An H2 receptor blocker that reduces stomach acid. Less common now.",
  "oxprelol": "A non-selective beta blocker, less commonly used now, for hypertension.",
  "paracetamol": "Commonly used to treat fever and mild to moderate pain.",
  "atorvastatin": "A statin used to lower cholesterol and triglycerides.",
  "metformin": "An oral medication that helps control blood sugar levels.",
  "amlodipine": "A calcium channel blocker used to treat high blood pressure.",
  "cetirizine": "An antihistamine used to relieve allergy symptoms.",
  "azithromycin": "An antibiotic used to treat a variety of bacterial infections.",
  "montelukast": "Used to prevent wheezing and difficulty breathing caused by asthma.",
  "losartan": "An ARB used to treat high blood pressure.",
  "sertraline": "An SSRI antidepressant used to treat depression and anxiety disorders.",
  "esomeprazole": "A proton pump inhibitor (PPI) that reduces stomach acid.",
  "clopidogrel": "An antiplatelet medicine used to prevent blood clots.",
  "levocetirizine": "A newer antihistamine, considered non-drowsy.",
  "domperidone": "A prokinetic agent used to treat nausea and vomiting.",
  "ibuprofen": "A common NSAID used for pain relief, fever, and inflammation.",
  "pregabalin": "Used to treat epilepsy, anxiety, and neuropathic (nerve) pain.",
  "tamsulosin": "An alpha-blocker used by men to treat the symptoms of an enlarged prostate (BPH).",
  "fexofenadine": "A non-drowsy antihistamine for seasonal allergies.",
  "glimepiride": "A sulfonylurea drug that helps the pancreas produce more insulin.",
  "bisoprolol": "A beta-blocker that affects the heart and circulation.",
  "tacrolimus": "An immunosuppressive drug used to prevent organ rejection after a transplant.",
  "colchicine": "Used to treat and prevent gout attacks.",
  "phenytoin": "An anti-epileptic drug used to control seizures.",
  "isotretinoin": "A powerful vitamin A derivative used to treat severe cystic acne.",
  "allopurinol": "Reduces the production of uric acid in the body, preventing gout.",
  "methotrexate": "An immunosuppressant used for rheumatoid arthritis and some cancers.",
  "sofosbuvir": "An antiviral medication used to treat Hepatitis C.",
  "enoxaparin": "An anticoagulant (LMWH) injection used to prevent deep vein thrombosis.",
  "rituximab": "A monoclonal antibody used to treat certain autoimmune diseases and cancers.",
  "ondansetron": "An antiemetic used to prevent nausea and vomiting caused by chemotherapy or surgery.",
  "carbamazepine": "An anticonvulsant used to treat epilepsy, bipolar disorder, and neuropathic pain.",
  "latanoprost": "Eye drops used to control the progression of glaucoma by reducing intraocular pressure.",
  "mycophenolate": "An immunosuppressant used to prevent organ rejection.",
  "adalimumab": "A biologic drug (TNF inhibitor) used for autoimmune conditions.",
  "acyclovir": "An antiviral medication used to treat herpes simplex, chickenpox, and shingles."
}